## Plan for audit/sre_bot
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_iam_policy.sre_vulnerability_report`                 |
|        | `aws_iam_role.sre_vulnerability_report`                   |
|        | `aws_iam_role_policy_attachment.sre_vulnerability_report` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.sre_vulnerability_report will be created
  + resource "aws_iam_policy" "sre_vulnerability_report" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "vulnerability_report"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "config:DescribeAggregateComplianceByConfigRules"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadConfig"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aft-audit-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aft-audit-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sre_vulnerability_report will be created
  + resource "aws_iam_role" "sre_vulnerability_report" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::274536870005:role/sre_vulnerability_report_github_action"
                        }
                      + Sid       = "AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_vulnerability_report"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aft-audit-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aft-audit-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.sre_vulnerability_report will be created
  + resource "aws_iam_role_policy_attachment" "sre_vulnerability_report" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_vulnerability_report"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
